SpenceKonde/DxCore/megaavr/boards.txt
##########################################################################
#                                                                        #
#  #######              #####                                            #
#  ##    ##            ##```                                             #
#  ##     ## ##   ##   ##      ###  ####  ####     ##     ####     ####  #
#  ##     ##  ## ##    ##     #   # #   # #       ###     #        #     #
#  ##     ##   ###     ##     #   # ####  ###      ##     ####     ####  #
#  ##    ##   ## ##    ##___  #   # # #   #        ##  ##    # ##     #  #
#  #######   ##   ##    #####  ###  #  #  ####    #### ## ###  ##  ###   #
#________________________________________________________________________#
#                                                                        #
#  Copyright Spence Konde and other contributors 2020-2021               #
#  Based on megaTinyCore which in turn is based on official Arduino core #
#  Varying portions of different files in this core can be traced back   #
#  to the official core. In any event, it's all free software, under the #
#  (LGPL v2.1) see LICENSE.md and License section of README.md           #
#________________________________________________________________________#
#                                                                        #
#  Now reformatted for easy navigation with text editing tools which     #
#  have the zoomed out view that you can scroll through.                 #
#  The board section headings have a triangle along the right edge       #
#  if they are a non-bootloader definition.                              #
#________________________________________________________________________#
#                                                                        #
#                   ####   ###   ###  ####  ####   ###                   #
#                   #   # #   # #   # #   # #   # #                      #
#                   ####  #   # ##### ####  #   #  ###                   #
#                   #   # #   # #   # #  #  #   #     #                  #
#                   ####   ###  #   # #   # ####   ###                   #
#________________________________________________________________________#
#                                                                        #
# Names listed at the top so they can be kept in consistent format.      #
# Experience has shown that they end up drifting apart is style if       #
# they aren't all on the same screen                                     #
#                                                                        #
# DA128 shipped Q1 2020. DA64 and DA32 shipped Q3/4 2020 (Q3 DA32's did  #
# not work correctly). First sign in radical changes to branding.        #
# DB128 shipped Q2 2020,  32DB shipped Q4 2020. First AVR with on-chip   #
#     OPAMPs.                                                            #
# DD (64k in high pincountes, 16/32 in low ones) shipped in Q2 2022.     #
#     By the end of the year all the expected parts were out in at least #
#     one package, but QFN28, and DIP28 are missing for the smaller ones #
#     and QFN20 is missing for 64k.                                      #
# EA (first fullsize parts w/diff ADC w/PGA) are not available yet.      #
# DU (Dx with native USB) may never be available, product brief vanished.#
# EB (2 novel timers and little else, possible tiny-killer) are not      #
#     available yet. Likely (hopefully) aimed at low price point.        #
##########################################################################


##########################################################################
#                                                                        #
#             ###  #   # ####  #   # #### #   # #   #  ###               #
#            #     #   # #   # ## ## #    ##  # #   # #                  #
#             ###  #   # ####  # # # ###  # # # #   #  ###               #
#                # #   # #   # #   # #    #  ## #   #     #              #
#             ###   ###  ####  #   # #### #   #  ###   ###               #
#________________________________________________________________________#
# The *opti menus are for Optiboot board definitions - We name them
# differently when the option takes on different meaning for a bootloaded
# board. Eg - UPDI can set fuses, so any fuse that can't brick the chip is written
# And we can assume all fuses have the the values that the user selected.
# But if Optiboot is in use, anything that requires changing a fuse requires burnbootloader
#_________________________________________________________________________

menu.chip=Chip
menu.board=Board/version
menu.clock=Clock Speed
menu.millis=millis()/micros() timer
menu.bodvoltage=BOD level if enabled (Bootload burn req'd)
menu.bodmode=BOD Mode Active/Sleeping (Bootload burn req'd)
menu.WDTtimeout=WDT Timeout (Bootload burn req'd)
menu.WDTwindow=WDT "window" (Bootload burn req'd)
menu.eesave=Save EEPROM
menu.eesavedd=Save EEPROM (Bootload burn req'd)
menu.resetpin=Reset pin function (Bootload burn req'd)
menu.resetupdipins=Reset and UPDI (Bootload burn req'd)
menu.resetupdipinsopti=Reset and UPDI (Bootload burn req'd)
menu.startuptime=Startup Time
menu.startuptimeopti=Startup Time (Bootload burn req'd)
menu.bootloaderusart=Bootloader Serial Port (Bootload burn req'd)
menu.bootloaderusartdd=Bootloader Serial Port (Bootload burn req'd)
menu.entrycond=Bootloader Entry Condition (Bootload burn req'd)
menu.appspm=Write to flash from app
menu.mvio=MultiVoltage I/O (MVIO)
menu.mvioopti=MultiVoltage I/O (MVIO) (Bootload burn req'd)
menu.attach=attachInterrupt() Version
menu.printf=printf()
menu.wiremode=Wire (Wire.h/I2C) Library mode
menu.optimization=Optimization level (see documentation)

##########################################################################
#                                                                        #
###              ####    ###    ###   ####   ####    ###               ###
#####            #   #  #   #  #   #  #   #  #   #  #                #####
#######          ####   #   #  #####  ####   #   #   ###           #######
#####            #   #  #   #  #   #  #  #   #   #      #            #####
###              ####    ###   #   #  #   #  ####    ###               ###
#________________________________________________________________________#
##########################################################################
# Names listed at the top so they can be kept in consistent format       #
# Only EA boards without optiboot sketched in - since we know like       #
# nothing about implementation. EB is commented out, but not sketched in #
# because there is no need to do that prior to the DA release.           #
#_________________________________________________________________________

