SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
avrda.menu.bodvoltage.1v9=1.9V
avrda.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrda.menu.bodvoltage.2v45=2.45V
avrda.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrda.menu.bodvoltage.2v70=2.70V
avrda.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrda.menu.bodvoltage.2v85=2.85V
avrda.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrda.menu.bodmode.disabled=Disabled/Disabled
avrda.menu.bodmode.enabled=Enabled/Enabled
avrda.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrda.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrda.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrda.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrda.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrda.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrda.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrda.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrda.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrda.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrda.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrda.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrda.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrda.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrda.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrda.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Retain EEPROM (EESAVE)                 #
#________________________________________#
avrda.menu.eesave.enable=EEPROM retained
avrda.menu.eesave.enable.bootloader.eesavebit=1
avrda.menu.eesave.disable=EEPROM not retained
avrda.menu.eesave.disable.bootloader.eesavebit=0

#----------------------------------------#
# Reset pin as input option              #
#________________________________________#
avrda.menu.resetpin.reset=Hardware Reset (recommended)
avrda.menu.resetpin.reset.bootloader.resetpinbits=10
avrda.menu.resetpin.input=Input (no output, ever)
avrda.menu.resetpin.input.bootloader.resetpinbits=00

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrda.menu.millis.tcb2=TCB2 (recommended)
avrda.menu.millis.disabled=Disabled
avrda.menu.millis.tcb0=TCB0
avrda.menu.millis.tcb1=TCB1
avrda.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrda.menu.millis.tcb4=TCB4 (64-pin parts only)
avrda.menu.millis.tca0=TCA0
avrda.menu.millis.tca1=TCA1 (48/64-pin parts only)
avrda.menu.millis.tcb0.build.millistimer=B0
avrda.menu.millis.tcb1.build.millistimer=B1
avrda.menu.millis.tcb2.build.millistimer=B2
avrda.menu.millis.tcb3.build.millistimer=B3
avrda.menu.millis.tcb4.build.millistimer=B4
avrda.menu.millis.tca0.build.millistimer=A0
avrda.menu.millis.tca1.build.millistimer=A1
avrda.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avrda.menu.printf.default=Default, 1.5k flash, no floats
avrda.menu.printf.full=Full, 2.6k, prints floats
avrda.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrda.menu.printf.full.build.printfabr=.pfF
avrda.menu.printf.minimal=Minimal, 1.1k flash used
avrda.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrda.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
avrda.menu.optimization.size=-Os (size)
avrda.menu.optimization.sizegcse=-Os (size, no GCSE)
avrda.menu.optimization.o3=-O3 (speed)
avrda.menu.optimization.o3gcse=-O3 (speed, no GCSE)
avrda.menu.optimization.size.build.optimizationlevel=-Os
avrda.menu.optimization.sizegcse.build.optimizationlevel=-Os
avrda.menu.optimization.o3.build.optimizationlevel=-O3
avrda.menu.optimization.o3gcse.build.optimizationlevel=-O3
avrda.menu.optimization.size.build.optabr=.Os
avrda.menu.optimization.sizegcse.build.optabr=.Osng
avrda.menu.optimization.o3.build.optabr=.O3
avrda.menu.optimization.o3gcse.build.optabr=.O3ng
avrda.menu.optimization.sizegcse.build.gcse=-fno-gcse
avrda.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avrda.menu.attach.allenabled=On all pins, with new implementation.
avrda.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrda.menu.attach.manual=Only enabled ports. Please see documentation
avrda.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrda.menu.attach.oldversion=Old version, (may fix bugs)
avrda.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avrda.menu.attach.manual.build.attachabr=.aMan
avrda.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrda.menu.startuptime.8=8ms
avrda.menu.startuptime.1=0ms
avrda.menu.startuptime.1=1ms
avrda.menu.startuptime.2=2ms
avrda.menu.startuptime.4=4ms
avrda.menu.startuptime.16=16ms
avrda.menu.startuptime.32=32ms
avrda.menu.startuptime.64=64ms
avrda.menu.startuptime.0.bootloader.SYSCFG1=0x00
avrda.menu.startuptime.1.bootloader.SYSCFG1=0x01
avrda.menu.startuptime.2.bootloader.SYSCFG1=0x02
avrda.menu.startuptime.4.bootloader.SYSCFG1=0x03
avrda.menu.startuptime.8.bootloader.SYSCFG1=0x04
avrda.menu.startuptime.16.bootloader.SYSCFG1=0x05
avrda.menu.startuptime.32.bootloader.SYSCFG1=0x06
avrda.menu.startuptime.64.bootloader.SYSCFG1=0x07

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
avrda.menu.wiremode.mors=1x Wire, Master or Slave (least Flash & RAM)
avrda.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avrda.menu.wiremode.mors.build.wireabr=.wO
avrda.menu.wiremode.mands=1x Wire, Master and Slave
avrda.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avrda.menu.wiremode.mands.build.wireabr=.wA
avrda.menu.wiremode.mors2=2x Wire, Master or Slave (32+ pin devices only)
avrda.menu.wiremode.mors2.build.wiremode=MORS_BOTH
avrda.menu.wiremode.mors2.build.wireabr=.wO2
avrda.menu.wiremode.mands2=2x Wire, Master and Slave (32+ pin devices only)
avrda.menu.wiremode.mands2.build.wiremode=MANDS_BOTH
avrda.menu.wiremode.mands2.build.wireabr=.wA2

