SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrddopti.bootloader.tool=avrdude
avrddopti.bootloader.file={runtime.platform.path}/bootloaders/hex/{bootloader.class}{bootloader.port}{bootloader.entrycond}.hex
avrddopti.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
avrddopti.bootloader.wdtwindowbits=0000
avrddopti.bootloader.wdttimeotbits=0000
avrddopti.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrddopti.bootloader.SYSCFG0=0b110{bootloader.resetpinbits}000
avrddopti.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
avrddopti.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
avrddopti.bootloader.CODESIZE=0x00
avrddopti.bootloader.BOOTSIZE=0x01
avrddopti.bootloader.avrdudestring=-Uflash:w:{bootloader.file}:i
avrddopti.bootloader.pymcuprogstring=-f "{bootloader.file}" -a write

#----------------------------------------#
# Upload parameters for Optiboot         #
#________________________________________#
avrddopti.upload.tool=avrdude
avrddopti.upload.protocol=arduino
avrddopti.upload.extra_params=-D
avrddopti.upload.speed=115200
avrddopti.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avrddopti.build.mcupostfix=opti
avrddopti.build.printfabr=
avrddopti.build.optabr=.Os
avrddopti.build.attachabr=
avrddopti.build.wireabr=
avrddopti.build.appspmabr=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DD submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
# 14/20-pin parts get default millis     #
# changed just like tinyAVRs do          #
#________________________________________#
avrddopti.menu.chip.avr64dd32=AVR64DD32
avrddopti.menu.chip.avr64dd28=AVR64DD28
avrddopti.menu.chip.avr64dd20=AVR64DD20
avrddopti.menu.chip.avr64dd14=AVR64DD14 (LED: PD7 if bootloader on Serial, else PD5)
avrddopti.menu.chip.avr32dd32=AVR32DD32
avrddopti.menu.chip.avr32dd28=AVR32DD28
avrddopti.menu.chip.avr32dd20=AVR32DD20
avrddopti.menu.chip.avr32dd14=AVR32DD14 (LED: PD7 if bootloader on Serial, else PD5)
avrddopti.menu.chip.avr16dd32=AVR16DD32
avrddopti.menu.chip.avr16dd28=AVR16DD28
avrddopti.menu.chip.avr16dd20=AVR16DD20
avrddopti.menu.chip.avr16dd14=AVR16DD14 (LED: PD7 if bootloader on Serial, else PD5)
avrddopti.menu.chip.avr64dd32.build.mcu=avr64dd32
avrddopti.menu.chip.avr64dd32.bootloader.class=optiboot_64dd
avrddopti.menu.chip.avr64dd32.upload.maximum_size=65024
avrddopti.menu.chip.avr64dd32.upload.maximum_data_size=8192
avrddopti.menu.chip.avr64dd32.build.highestcb=B2
avrddopti.menu.chip.avr64dd32.build.variant=32pin-ddseries
avrddopti.menu.chip.avr64dd28.build.mcu=avr64dd28
avrddopti.menu.chip.avr64dd28.bootloader.class=optiboot_64dd
avrddopti.menu.chip.avr64dd28.upload.maximum_size=65024
avrddopti.menu.chip.avr64dd28.upload.maximum_data_size=8192
avrddopti.menu.chip.avr64dd28.build.variant=28pin-ddseries
avrddopti.menu.chip.avr64dd28.build.highestcb=B2
avrddopti.menu.chip.avr64dd20.build.mcu=avr64dd20
avrddopti.menu.chip.avr64dd20.bootloader.class=optiboot_64dd
avrddopti.menu.chip.avr64dd20.upload.maximum_size=65024
avrddopti.menu.chip.avr64dd20.upload.maximum_data_size=8192
avrddopti.menu.chip.avr64dd20.build.highestcb=B1
avrddopti.menu.chip.avr64dd20.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrddopti.menu.chip.avr64dd20.build.variant=20pin-ddseries
avrddopti.menu.chip.avr64dd14.build.mcu=avr64dd14
avrddopti.menu.chip.avr64dd14.bootloader.class=optiboot_64dd14
avrddopti.menu.chip.avr64dd14.upload.maximum_size=65024
avrddopti.menu.chip.avr64dd14.upload.maximum_data_size=8192
avrddopti.menu.chip.avr64dd14.build.highestcb=B1
avrddopti.menu.chip.avr64dd14.build.variant=14pin-ddseries
avrddopti.menu.chip.avr64dd14.build.14pinled={build.altled}
avrddopti.menu.chip.avr64dd14.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrddopti.menu.chip.avr32dd32.build.mcu=avr32dd32
avrddopti.menu.chip.avr32dd32.bootloader.class=optiboot_32dd
avrddopti.menu.chip.avr32dd32.upload.maximum_size=32256
avrddopti.menu.chip.avr32dd32.upload.maximum_data_size=4096
avrddopti.menu.chip.avr32dd32.build.variant=32pin-ddseries
avrddopti.menu.chip.avr32dd28.build.mcu=avr32dd28
avrddopti.menu.chip.avr32dd28.bootloader.class=optiboot_32dd
avrddopti.menu.chip.avr32dd28.upload.maximum_size=32256
avrddopti.menu.chip.avr32dd28.upload.maximum_data_size=4096
avrddopti.menu.chip.avr32dd28.build.variant=28pin-ddseries
avrddopti.menu.chip.avr32dd20.build.mcu=avr32dd20
avrddopti.menu.chip.avr32dd20.bootloader.class=optiboot_32dd
avrddopti.menu.chip.avr32dd20.upload.maximum_size=32256
avrddopti.menu.chip.avr32dd20.upload.maximum_data_size=4096
avrddopti.menu.chip.avr32dd20.build.highestcb=B1
avrddopti.menu.chip.avr32dd20.build.variant=20pin-ddseries
avrddopti.menu.chip.avr32dd20.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrddopti.menu.chip.avr32dd14.build.mcu=avr32dd14
avrddopti.menu.chip.avr32dd14.bootloader.class=optiboot_32dd14
avrddopti.menu.chip.avr32dd14.upload.maximum_size=32256
avrddopti.menu.chip.avr32dd14.upload.maximum_data_size=4096
avrddopti.menu.chip.avr32dd14.build.highestcb=B1
avrddopti.menu.chip.avr32dd14.build.variant=14pin-ddseries
avrddopti.menu.chip.avr32dd14.build.14pinled={build.altled}
avrddopti.menu.chip.avr32dd14.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrddopti.menu.chip.avr16dd32.build.mcu=avr16dd32
avrddopti.menu.chip.avr16dd32.bootloader.class=optiboot_32dd
avrddopti.menu.chip.avr16dd32.upload.maximum_size=15872
avrddopti.menu.chip.avr16dd32.upload.maximum_data_size=2048
avrddopti.menu.chip.avr16dd32.build.variant=32pin-ddseries
avrddopti.menu.chip.avr16dd28.build.mcu=avr16dd28
avrddopti.menu.chip.avr16dd28.bootloader.class=optiboot_32dd
avrddopti.menu.chip.avr16dd28.upload.maximum_size=15872
avrddopti.menu.chip.avr16dd28.upload.maximum_data_size=2048
avrddopti.menu.chip.avr16dd28.build.variant=28pin-ddseries
avrddopti.menu.chip.avr16dd20.build.mcu=avr16dd20
avrddopti.menu.chip.avr16dd20.bootloader.class=optiboot_32dd
avrddopti.menu.chip.avr16dd20.upload.maximum_size=15872
avrddopti.menu.chip.avr16dd20.upload.maximum_data_size=2048
avrddopti.menu.chip.avr16dd20.build.highestcb=B1
avrddopti.menu.chip.avr16dd20.build.variant=20pin-ddseries
avrddopti.menu.chip.avr16dd20.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrddopti.menu.chip.avr16dd14.build.mcu=avr16dd14
avrddopti.menu.chip.avr16dd14.bootloader.class=optiboot_32dd14
avrddopti.menu.chip.avr16dd14.upload.maximum_size=15872
avrddopti.menu.chip.avr16dd14.upload.maximum_data_size=2048
avrddopti.menu.chip.avr16dd14.build.highestcb=B1
avrddopti.menu.chip.avr16dd14.build.variant=14pin-ddseries
avrddopti.menu.chip.avr16dd14.build.14pinled={build.altled}
avrddopti.menu.chip.avr16dd14.build.defaultswaps=-DMUX_DEFAULT_USART1=2


