SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# MVIO menu                              #
#________________________________________#
azduinoboard.menu.mvioopti.enabled=Enabled
azduinoboard.menu.mvioopti.enabled.bootloader.mviobits=01
azduinoboard.menu.mvioopti.enabled.build.mvioenable=-DMVIO_ENABLED
azduinoboard.menu.mvioopti.disabled=Disabled
azduinoboard.menu.mvioopti.disabled.bootloader.mviobits=10
azduinoboard.menu.mvioopti.disabled.build.mvioenable=
azduinoboard.menu.mvioopti.reallyenabled=Enabled. Assume that "burn bootloader" has been performed with this option.
azduinoboard.menu.mvioopti.reallyenabled.bootloader.mviobits=01
azduinoboard.menu.mvioopti.reallyenabled.build.mvioenable==-DMVIO_ENABLED -DASSUME_MVIO_FUSE
azduinoboard.menu.mvioopti.reallydisabled=Disabled. Assume that "burn bootloader" has been performed with this option.
azduinoboard.menu.mvioopti.reallydisabled.bootloader.mviobits=10
azduinoboard.menu.mvioopti.reallydisabled.build.mvioenable=-DASSUME_MVIO_FUSE

#----------------------------------------#
# Startup time options                   #
#________________________________________#
azduinoboard.menu.startuptime.8=8ms
azduinoboard.menu.startuptime.0=0ms
azduinoboard.menu.startuptime.1=1ms
azduinoboard.menu.startuptime.2=2ms
azduinoboard.menu.startuptime.4=4ms
azduinoboard.menu.startuptime.16=16ms
azduinoboard.menu.startuptime.32=32ms
azduinoboard.menu.startuptime.64=64ms
azduinoboard.menu.startuptime.0.bootloader.sutbits=000
azduinoboard.menu.startuptime.1.bootloader.sutbits=001
azduinoboard.menu.startuptime.2.bootloader.sutbits=010
azduinoboard.menu.startuptime.4.bootloader.sutbits=011
azduinoboard.menu.startuptime.8.bootloader.sutbits=100
azduinoboard.menu.startuptime.16.bootloader.sutbits=101
azduinoboard.menu.startuptime.32.bootloader.sutbits=110
azduinoboard.menu.startuptime.64.bootloader.sutbits=111

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
azduinoboard.menu.wiremode.mors=1x Wire, Master or Slave (least Flash & RAM)
azduinoboard.menu.wiremode.mors.build.wiremode=MORS_SINGLE
azduinoboard.menu.wiremode.mors.build.wireabr=.wO
azduinoboard.menu.wiremode.mands=1x Wire, Master and Slave
azduinoboard.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
azduinoboard.menu.wiremode.mands.build.wireabr=.wA
azduinoboard.menu.wiremode.mors2=2x Wire, Master or Slave (not available on Nano DD)
azduinoboard.menu.wiremode.mors2.build.wiremode=MORS_BOTH
azduinoboard.menu.wiremode.mors2.build.wireabr=.wO2
azduinoboard.menu.wiremode.mands2=2x Wire, Master and Slave (not available on Nano DB)
azduinoboard.menu.wiremode.mands2.build.wiremode=MANDS_BOTH
azduinoboard.menu.wiremode.mands2.build.wireabr=.wA2


#----------------------------------------#
# WDT MODE                               #
#________________________________________#
azduinoboard.menu.WDTtimeout.disabled=Disabled (recommended)
azduinoboard.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
azduinoboard.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
azduinoboard.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
azduinoboard.menu.WDTtimeout.1second=Window remains open for 1 Second
azduinoboard.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
azduinoboard.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
azduinoboard.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
azduinoboard.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
azduinoboard.menu.WDTwindow.disabled=No delay before window "opens"
azduinoboard.menu.WDTwindow.8seconds=8 Second before window "opens"
azduinoboard.menu.WDTwindow.4seconds=4 Second before window "opens"
azduinoboard.menu.WDTwindow.2seconds=2 Second before window "opens"
azduinoboard.menu.WDTwindow.1second=1 Second before window "opens"
azduinoboard.menu.WDTwindow.500msec=500 millisecond before window "opens"
azduinoboard.menu.WDTwindow.250msec=250 millisecond before window "opens"
azduinoboard.menu.WDTwindow.125msec=125 millisecond before window "opens"
azduinoboard.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
azduinoboard.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
azduinoboard.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
azduinoboard.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
azduinoboard.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
azduinoboard.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
azduinoboard.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
azduinoboard.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
azduinoboard.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
azduinoboard.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
azduinoboard.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
azduinoboard.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
azduinoboard.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
azduinoboard.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
azduinoboard.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
azduinoboard.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
azduinoboard.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
azduinoboard.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
azduinoboard.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100
